// ДОП.ЗАДАЧА:
// Задача 42: Напишите программу, которая будет преобразовывать десятичное число в двоичное.
// 45 -> 101101
// 3 -> 11
// 2 -> 10
//////////////////////////////////////////////////////////////////////////////////////////////////
// Для решения задачи воспользуемся методом 
// "ToString(Int32, Int32)" -> преобразует значение заданного 32-битового целого числа со знаком
//  в эквивалентное строковое представление в указанной системе счисления.
//////////////////////////////////////////////////////////////////////////////////////////////////

Console.Write("Введите число = ");
int number = Convert.ToInt32(Console.ReadLine());
System.Console.WriteLine($"\n{number} -> {Convert.ToString(number,2)}\n");// Преобразуем значение number₁₀ -> number₂
